import os
import sys
from tqdm import tqdm

_ROOT_PATH = os.path.abspath(__file__)
for i in range(3):
    _ROOT_PATH = os.path.dirname(_ROOT_PATH)
sys.path.insert(0, _ROOT_PATH)

from KGs.dataset_KGs.cpl_value_range import*
from copy import deepcopy
from collections import OrderedDict

__all__=["cpl_kg_schema"]


# 实际对应的Keyword
# 日期6+3 = 9；金额7；百分比6=22
cpl_keyword = {
    "需返回本金总额（元）" : { 
        "keyword": ["元"], 
        "warning": "需返回本金总额指的是被告一共需要归还给原告的金额，单位为元，例如若为50万元，需要转换为500000元的形式。"
    },
    '需返回利息总额（元）' : { 
        "keyword": ["元"], 
        "warning": "单位为元，例如若为50万元，需要转换为500000元的形式。"
    },
    '需返回利息计算起始日期' : { 
        "keyword":  ["年", "月", "息"], 
        "warning": "请重点关注上下文中具备年-月-日格式的部分。"
        },
    '需返回利息计算截止日期' : { 
        "keyword":  ["年", "月", "息"], 
        "warning": "请重点关注上下文中具备年-月-日格式的部分。"
    },
    '需返还利息率数值（百分比或元）' : { 
        "keyword": ["%", "息"], 
        "warning": "请重点关注上下文中有%符号后缀的数值。"
    },


    '需返回违约金总额（元）' : { 
        "keyword": ["元", "违约"], 
        "warning": "单位为元，例如若为50万元，需要转换为500000元的形式。不要和本金、利息混淆。"
    },
    '需返回违约金计算起始日期' : { 
        "keyword": ["年", "月", "违约"], 
        "warning": "请重点关注上下文中具备年-月-日格式的部分。不要和本金、利息混淆。"
    },
    '需返回违约金计算截止日期' : { 
        "keyword": ["年", "月", "违约"], 
        "warning": "请重点关注上下文中具备年-月-日格式的部分。不要和本金、利息混淆。"
    },
    '需返还违约金数值（百分比或元）' : { 
        "keyword": ["%", "违约"], 
        "warning": "请重点关注上下文中有%符号后缀的数值。不要和利息率混淆。"
    },

    
    # 借贷事件
   
    # 约定事实信息
    '初始约定的借款金额（元）' : { 
        "keyword": ["元"], 
        "warning": "重点是首次约定的借款，不要和实际交付的金额混淆。单位为元，例如若为50万元，需要转换为500000元的形式。"
    },
   
    '初始约定的还款日期' : { 
        "keyword": ["年", "月", "还"], 
        "warning": "请重点关注上下文中具备年-月-日格式的部分。不要和实际归还的日期混淆。"
    },
    
    '初始约定的利率数值（百分比或元）' : { 
        "keyword": ["%", "利率"], 
        "warning": "请重点关注上下文中有%符号后缀的数值。"
    },

    '初始约定的逾期利率数值（百分比或元）' : { 
        "keyword": ["%", "利率"], 
        "warning": "请重点关注上下文中有%符号后缀的数值。很少见，不要和正常利率混淆。"
    },
   
    '初始约定的违约金数值（百分比或元）' : { 
        "keyword": ["%", "违约"], 
        "warning": "请重点关注上下文中有%符号后缀的数值。很少见，不要和利率混淆。"
    },
    
    '借款实际交付金额1（元）' : { 
        "keyword": ["元"], 
        "warning": "是实际上原告给被告的金额，不要和约定的借款金额混淆。单位为元，例如若为50万元，需要转换为500000元的形式。"
    },
    '借款实际交付时间1' : { 
        "keyword": ["年", "月"], 
        "warning":  "请重点关注上下文中具备年-月-日格式的部分。是实际上原告把钱给被告的日期，不要和其他的日期混淆。"
    },
  
    '已还款时间1' : { 
        "keyword": ["年", "月", "还"], 
        "warning":  "请重点关注上下文中具备年-月-日格式的部分。是被告还钱给原告的日期，不要和其他日期混淆。"
    },
    '已还款金额1（元）' : { 
        "keyword": ["元", "还"], 
        "warning": "是被告第一次实际还给原告的金额，不要和其他金额混淆。单位为元，例如若为50万元，需要转换为500000元的形式。"
    },
}

# 实际使用的字段
Plaintiff_claim_attributes = OrderedDict({
    "姓名名称" : value_range["字符串"],
    # 诉讼请求
   
    "需返回本金总额（元）" : value_range["金额"],
    '需返回利息总额（元）' : value_range["金额"],
    '需返回利息计算起始日期' : value_range["日期值"],
    '需返回利息计算截止日期' : value_range["日期值"],
    '需返还利息率数值（百分比或元）' : value_range["率数值"],

    '需返回违约金总额（元）' : value_range["金额"],
    '需返回违约金计算起始日期' : value_range["日期值"],
    '需返回违约金计算截止日期' : value_range["日期值"],
    '需返还违约金数值（百分比或元）' : value_range["率数值"],

    
    # 借贷事件
   
    # 约定事实信息
    '初始约定的借款金额（元）' : value_range["金额"],
   
    '初始约定的还款日期' : value_range["日期值"],
    
    '初始约定的利率数值（百分比或元）' : value_range["率数值"],

    '初始约定的逾期利率数值（百分比或元）' : value_range["率数值"],
   
    '初始约定的违约金数值（百分比或元）' : value_range["率数值"],
    
    '借款实际交付金额1（元）' : value_range["金额"],
    '借款实际交付时间1' : value_range["日期值"],
  
    '已还款时间1' : value_range["日期值"],
    '已还款金额1（元）' : value_range["金额"],
})

cpl_keyword_total = OrderedDict({
    "姓名名称" : ["姓名", "名称"],
    # 诉讼请求
    "是否变更诉讼请求" : ["变更", "诉讼请求"],
    "需返回本金总额（元）" : [ "本金", "总额"],
    '需返回利息总额（元）' : [ "利息", "总额"],
    '需返回利息计算起始日期' : ["利息", "日期"],
    '需返回利息计算起始日期类型' : ["利息", "日期"],
    '需返回利息计算截止日期' : ["利息", "日期"],
    '需返回利息计算截止日期类型' : ["利息", "日期"],
    '需返还利息率类型' : ["利息", "率"],
    '需返还利息率数值（百分比或元）' : ["利息", "率"],
    '需返回逾期利息总额（元）' : ["利息", "逾期"],
    '需返回逾期利息计算起始日期' : ["利息", "逾期"],
    '需返回逾期利息计算起始日期类型' : ["利息", "逾期"],
    '需返回逾期利息计算截止日期' : ["利息", "逾期"],
    '需返回逾期利息计算截止日期类型' : ["利息", "逾期"],
    '需返还逾期利息率类型' : ["利息", "逾期", "率"],
    '需返还逾期利息率数值（百分比或元）' : ["利息", "逾期", "率"],
    '需返回违约金总额（元）' : ["违约", "总额"],
    '需返回违约金计算起始日期' : [ "违约" , "日期"],
    '需返回违约金计算起始日期类型' : ["违约", "日期"],
    '需返回违约金计算截止日期' : ["违约", "日期"],
    '需返回违约金计算截止日期类型' : ["违约", "日期"],
    '需返还违约金类型' : ["违约"],
    '需返还违约金数值（百分比或元）' : ["违约"],
    '是否要求承担担保责任' : ["担保", "连带"],
    '承担保证责任的人或单位名称' : ["担保", "连带"],
    '保证责任类型' : ["担保", "连带", "责任"],
    '需返回债权实现费用（起诉前）总额（元）' : [ "债权", "费", "总额"],
    '需返回债权实现费用（起诉前）类型' : ["债权", "费"],
    '需返回债权实现费用（起诉后）总额（元）' : ["债权", "费"],
    '需返回债权实现费用（起诉后）类型' : ["债权", "费"],
    
    # 借贷事件
    # 借款事实信息
    "借款目的与用途类型" : [ "借款" , "目的", "用途"],
    "借款人与出借人关系类型" : ["借款" , "关系"],
    "担保人的姓名或单位名称" : ["担保", "名",],
    "借款人与担保人关系类型" : ["借款" ,"担保", "关系"],
    "意思表示日" : ["借款" , "日"],
    "借款次数" : [ "借款", "次"],
    "借款次数情况" : ["借款", "次"],
    "是否有借款凭证" : ["借款", "证据", "凭证"],
    # 约定事实信息
    '借款凭证1名称' : ["借款", "证据", "凭证"],
    '借款凭证1类型' : ["借款", "证据", "凭证"],
    '借款凭证1出具时间' : ["借款", "证据", "凭证", "时间", "日"],
    '借款凭证1所载内容' : ["借款", "证据", "凭证"],
    '借款凭证2名称' : ["借款", "证据", "凭证"],
    '借款凭证2类型' : ["借款", "证据", "凭证"],
    '借款凭证2出具时间' : ["借款", "证据", "凭证", "时间", "日"],
    '借款凭证2所载内容' : ["借款", "证据", "凭证"],
    '借款凭证3名称' : ["借款", "证据", "凭证"],
    '借款凭证3类型' : ["借款", "证据", "凭证"],
    '借款凭证3出具时间' : ["借款", "证据", "凭证"],
    '借款凭证3所载内容' : ["借款", "证据", "凭证", "时间", "日"],
    '初始约定的借款金额情况' : [ "约定", "借款", "金额"],
    '初始约定的实际发生时间' : [ "约定", "借款", "时间"],
    '初始约定的借款金额（元）' : [ "约定", "借款", "金额"],
    '第2次约定的借款金额情况' : [ "约定", "借款", "金额"],
    '第2次约定的实际发生时间' : [ "约定", "借款", "时间"],
    '第2次约定的借款金额（元）' : [ "约定", "借款", "金额"],
    '第3次约定的借款金额情况' : [ "约定", "借款", "金额"],
    '第3次约定的实际发生时间' : [ "约定", "借款", "时间"],
    '第3次约定的借款金额（元）' : [ "约定", "借款", "金额"],
    '初始约定的还款日期或借款期限情况' : [ "约定", "还款", "日期", "期限"],
    '初始约定的实际发生时间' : ["约定", "还款", "日期", "期限"],
    '初始约定的借款起始日期' : ["约定", "还款", "日期", "期限"],
    '初始约定的还款日期' : ["约定", "还款", "日期", "期限"],
    '初始约定的借款期限（月）' : ["约定", "还款", "日期", "期限"],
    '第2次约定的还款日期或借款期限情况' : ["约定", "还款", "日期", "期限"],
    '第2次约定的实际发生时间' : ["约定", "还款", "日期", "期限"],
    '第2次约定的借款起始日期' : ["约定", "还款", "日期", "期限"],
    '第2次约定的还款日期' : ["约定", "还款", "日期", "期限"],
    '第2次约定的借款期限（月）' : ["约定", "还款", "日期", "期限"],
    '第3次约定的还款日期或借款期限情况' : ["约定", "还款", "日期", "期限"],
    '第3次约定的实际发生时间' : ["约定", "还款", "日期", "期限"],
    '第3次约定的借款起始日期' : ["约定", "还款", "日期", "期限"],
    '第3次约定的还款日期' : ["约定", "还款", "日期", "期限"],
    '第3次约定的借款期限（月）' : ["约定", "还款", "日期", "期限"],
    '初始约定的利息情况' : ["约定", "利息" ],
    '初始约定的实际发生时间' : ["约定", "利息"],
    '初始约定的利率类型' : ["约定", "利息", "率"],
    '初始约定的利率数值（百分比或元）' : ["约定", "利息", "率"],
    '第2次约定的利息情况' : ["约定", "利息"],
    '第2次约定的实际发生时间' : ["约定", "利息", "率"],
    '第2次约定的利率类型' : ["约定", "利息", "率"],
    '第2次约定的利率数值（百分比或元）' : ["约定", "利息", "率"],
    '第3次约定的利息情况' : ["约定", "利息", "率"],
    '第3次约定的实际发生时间' : ["约定", "利息", "率"],
    '第3次约定的利率类型' : ["约定", "利息", "率"],
    '第3次约定的利率数值（百分比或元）' : ["约定", "利息", "率"],
    '初始约定的逾期利息情况' : ["约定", "利息", "逾期"],
    '初始约定的实际发生时间' : ["约定", "利息", "逾期"],
    '初始约定的逾期利率类型' : ["约定", "利息", "逾期"],
    '初始约定的逾期利率数值（百分比或元）' : ["约定", "利息", "逾期"],
    '第2次约定的逾期利息情况' : ["约定", "利息", "逾期"],
    '第2次约定的实际发生时间' : ["约定", "利息", "逾期"],
    '第2次约定的逾期利率类型' : ["约定", "利息", "逾期"],
    '第2次约定的逾期利率数值（百分比或元）' : ["约定", "利息", "逾期"],
    '第3次约定的逾期利息情况' : ["约定", "利息", "逾期"],
    '第3次约定的实际发生时间' : ["约定", "利息", "逾期"],
    '第3次约定的逾期利率类型' : ["约定", "利息", "逾期"],
    '第3次约定的逾期利率数值（百分比或元）' : ["约定", "利息", "逾期"],
    '初始约定的违约金情况' : ["约定", "违约"],
    '初始约定的实际发生时间' : ["约定", "违约"],
    '初始约定的违约金类型' : ["约定", "违约"],
    '初始约定的违约金数值（百分比或元）' : ["约定", "违约"],
    '第2次约定的违约金情况' : ["约定", "违约"],
    '第2次约定的实际发生时间' : ["约定", "违约"],
    '第2次约定的违约金类型' : ["约定", "违约"],
    '第2次约定的违约金数值（百分比或元）' : ["约定", "违约"],
    '第3次约定的违约金情况' : ["约定", "违约"],
    '第3次约定的实际发生时间' : ["约定", "违约"],
    '第3次约定的违约金类型' : ["约定", "违约"],
    '第3次约定的违约金数值（百分比或元）' : ["约定", "违约"],
    '管辖约定情况' : ["约定", "管辖"],
    '仲裁约定情况' : ["约定", "仲裁"],
    '程序性费用的承担（律师费、诉讼费等）约定情况' : ["约定", "程序", "诉讼", "费"],
    '约定程序性费用承担情况类型' : ["约定", "程序", "诉讼", "费"],
    '初始约定的还款方式情况' : ["约定", "还款" ],
    '初始约定的实际发生时间' : ["约定", "还款"],
    '初始约定的本金还款方式' : ["约定", "还款"],
    '初始约定的利息还款方式' : ["约定", "还款"],
    '前述还款方式下每次还款总金额（元）' : ["约定", "还款"],
    '前述还款方式下每次还款日期' : ["约定", "还款"],
    '第2次约定的还款方式情况' : ["约定", "还款"],
    '第2次约定的实际发生时间' : ["约定", "还款"],
    '第2次约定的本金还款方式' : ["约定", "还款"],
    '第2次约定的利息还款方式' : ["约定", "还款"],
    '前述还款方式下每次还款总金额（元）' : ["约定", "还款"],
    '前述还款方式下每次还款日期' : ["约定", "还款"],
    '第3次约定的还款方式情况' : ["约定", "还款"],
    '第3次约定的实际发生时间' : ["约定", "还款"],
    '第3次约定的本金还款方式' : ["约定", "还款"],
    '第3次约定的利息还款方式' : ["约定", "还款"],
    '前述还款方式下每次还款总金额（元）' : ["约定", "还款"],
    '前述还款方式下每次还款日期' : ["约定", "还款"],
    '初始约定的担保情况' : ["约定", "担保"],
    '初始约定的实际发生时间' : ["约定", "担保"],
    '初始约定的担保方式类型' : ["约定", "担保"],
    '初始约定的担保范围' : ["约定", "担保"],
    '初始约定的担保期限（月）' : ["约定", "担保"],
    '担保物当下状态' : [ "担保"],
    '初始约定的担保人类型' : ["约定", "担保"],
    '初始约定的保证责任类型' : ["约定", "担保", "责任"],
    '第2次约定的担保情况' : ["约定", "担保"],
    '第2次约定的实际发生时间' : ["约定", "担保"],
    '第2次约定的担保方式类型' : ["约定", "担保"],
    '第2次约定的担保范围' : ["约定", "担保"],
    '第2次约定的担保期限（月）' : ["约定", "担保"],
    '担保物当下状态' : ["约定", "担保"],
    '第2次约定的担保人类型' : ["约定", "担保"],
    '第2次约定的保证责任类型' : ["约定", "担保"],
    '第3次约定的担保情况' : ["约定", "担保"],
    '第3次约定的实际发生时间' : ["约定", "担保"],
    '第3次约定的担保方式类型' : ["约定", "担保"],
    '第3次约定的担保范围' : ["约定", "担保"],
    '第3次约定的担保期限（月）' : ["约定", "担保"],
    '担保物当下状态' : ["约定", "担保"],
    '第3次约定的担保人类型' : ["约定", "担保"],
    '第3次约定的保证责任类型' : ["约定", "担保"],
    '借款实际交付金额1（元）' : ["借款", "金额", "交付"],
    '借款实际交付时间1' : ["借款", "金额", "交付"],
    '借款实际交付方式类型1' : ["借款", "金额", "交付"],
    '借款实际交付1所对应的是第几笔借款' : ["借款", "金额", "交付"],
    '借款实际交付金额2（元）' : ["借款", "金额", "交付"],
    '借款实际交付时间2' : ["借款", "金额", "交付"],
    '借款实际交付方式类型2' : ["借款", "金额", "交付"],
    '借款实际交付2所对应的是第几笔借款' : ["借款", "金额", "交付"],
    '借款实际交付金额3（元）' : ["借款", "金额", "交付"],
    '借款实际交付时间3' : ["借款", "金额", "交付"],
    '借款实际交付方式类型3' : ["借款", "金额", "交付"],
    '借款实际交付3所对应的是第几笔借款' : ["借款", "金额", "交付"],
    '已还款总体情况类型' : ["还款"],
    '已还款时间1' : ["还款"],
    '已还款金额1（元）' : ["还款"],
    '已还款方式1' : ["还款"],
    '已还款金额性质1' : ["还款"],
    '已还款金额1所对应的是第几笔借款' : ["还款"],
    '已还款金额1所冲抵利息至哪一日' : ["还款"],
    '已还款时间2' : ["还款"],
    '已还款金额2（元）' : ["还款"],
    '已还款方式2' : ["还款"],
    '已还款金额性质2' : ["还款"],
    '已还款金额2所对应的是第几笔借款' : ["还款"],
    '已还款金额2所冲抵利息至哪一日' : ["还款"],
    '已还款时间3' : ["还款"],
    '已还款金额3（元）' : ["还款"],
    '已还款方式3' : ["还款"],
    '已还款金额性质3' : ["还款"],
    '已还款金额3所对应的是第几笔借款' : ["还款"],
    '已还款金额3所冲抵利息至哪一日' : ["还款"],
    # 特殊
    "法院对夫妻债务的认定": ["夫妻", "共同", "债务"],
    "法院对砍头息的认定" : ["砍头息"],
    "法院对公司为股东担保的效力的认定" : ["砍头息"],
    "债权取得类型" : ["债权"],
    "法院对主体资格与合同效力的认定" : ["效力"],
    "法院对职业放贷人的认定" : ["放贷"],
    "法院对是否属于互联网平台责任的认定" : ["平台"],
    "法院对民事案件的处理程序" : ["处理", "程序"],
})

# 全体字段
_Plaintiff_claim_attributes = OrderedDict({
    "姓名名称" : value_range["字符串"],
    # 诉讼请求
    "是否变更诉讼请求" : value_range["是否"],
    "需返回本金总额（元）" : value_range["金额"],
    '需返回利息总额（元）' : value_range["金额"],
    '需返回利息计算起始日期' : value_range["日期值"],
    '需返回利息计算起始日期类型' : value_range["起始日期类型"],
    '需返回利息计算截止日期' : value_range["日期值"],
    '需返回利息计算截止日期类型' : value_range["截止日期类型"],
    '需返还利息率类型' : value_range["利率类型"],
    '需返还利息率数值（百分比或元）' : value_range["率数值"],
    '需返回逾期利息总额（元）' : value_range["金额"],
    '需返回逾期利息计算起始日期' : value_range["日期值"],
    '需返回逾期利息计算起始日期类型' : value_range["起始日期类型"],
    '需返回逾期利息计算截止日期' : value_range["日期值"],
    '需返回逾期利息计算截止日期类型' : value_range["截止日期类型"],
    '需返还逾期利息率类型' : value_range["利率类型"],
    '需返还逾期利息率数值（百分比或元）' : value_range["率数值"],
    '需返回违约金总额（元）' : value_range["金额"],
    '需返回违约金计算起始日期' : value_range["日期值"],
    '需返回违约金计算起始日期类型' : value_range["起始日期类型"],
    '需返回违约金计算截止日期' : value_range["日期值"],
    '需返回违约金计算截止日期类型' : value_range["截止日期类型"],
    '需返还违约金类型' : value_range["利率类型"],
    '需返还违约金数值（百分比或元）' : value_range["率数值"],
    '是否要求承担担保责任' : value_range["是否"],
    '承担保证责任的人或单位名称' : value_range["字符串"],
    '保证责任类型' : value_range["担保责任类型"],
    '需返回债权实现费用（起诉前）总额（元）' : value_range["金额"],
    '需返回债权实现费用（起诉前）类型' : value_range["费用类型"],
    '需返回债权实现费用（起诉后）总额（元）' : value_range["金额"],
    '需返回债权实现费用（起诉后）类型' : value_range["费用类型"],
    
    # 借贷事件
    # 借款事实信息
    "借款目的与用途类型" : value_range["借款用途"],
    "借款人与出借人关系类型" : value_range["借款人与出借人关系类型"],
    "担保人的姓名或单位名称" : value_range["字符串"],
    "借款人与担保人关系类型" : value_range["借款人与出借人关系类型"],
    "意思表示日" : value_range["日期值"],
    "借款次数" : value_range["数值"],
    "借款次数情况" : value_range["借款次数情况"],
    "是否有借款凭证" : value_range["是否"],
    # 约定事实信息
    '借款凭证1名称' : value_range["字符串"],
    '借款凭证1类型' : value_range["借款凭证类型"],
    '借款凭证1出具时间' : value_range["日期值"],
    '借款凭证1所载内容' : value_range["字符串"],
    '借款凭证2名称' : value_range["字符串"],
    '借款凭证2类型' : value_range["借款凭证类型"],
    '借款凭证2出具时间' : value_range["日期值"],
    '借款凭证2所载内容' : value_range["字符串"],
    '借款凭证3名称' : value_range["字符串"],
    '借款凭证3类型' : value_range["借款凭证类型"],
    '借款凭证3出具时间' : value_range["日期值"],
    '借款凭证3所载内容' : value_range["字符串"],
    '初始约定的借款金额情况' : value_range["约定情况"],
    '初始约定的实际发生时间' : value_range["日期值"],
    '初始约定的借款金额（元）' : value_range["金额"],
    '第2次约定的借款金额情况' : value_range["约定情况"],
    '第2次约定的实际发生时间' : value_range["日期值"],
    '第2次约定的借款金额（元）' : value_range["金额"],
    '第3次约定的借款金额情况' : value_range["约定情况"],
    '第3次约定的实际发生时间' : value_range["日期值"],
    '第3次约定的借款金额（元）' : value_range["金额"],
    '初始约定的还款日期或借款期限情况' : value_range["约定情况"],
    '初始约定的实际发生时间' : value_range["日期值"],
    '初始约定的借款起始日期' : value_range["日期值"],
    '初始约定的还款日期' : value_range["日期值"],
    '初始约定的借款期限（月）' : value_range["数值"],
    '第2次约定的还款日期或借款期限情况' : value_range["约定情况"],
    '第2次约定的实际发生时间' : value_range["日期值"],
    '第2次约定的借款起始日期' : value_range["日期值"],
    '第2次约定的还款日期' : value_range["日期值"],
    '第2次约定的借款期限（月）' : value_range["数值"],
    '第3次约定的还款日期或借款期限情况' : value_range["约定情况"],
    '第3次约定的实际发生时间' : value_range["日期值"],
    '第3次约定的借款起始日期' : value_range["日期值"],
    '第3次约定的还款日期' : value_range["日期值"],
    '第3次约定的借款期限（月）' : value_range["数值"],
    '初始约定的利息情况' : value_range["约定情况"],
    '初始约定的实际发生时间' : value_range["日期值"],
    '初始约定的利率类型' : value_range["利率类型"],
    '初始约定的利率数值（百分比或元）' : value_range["率数值"],
    '第2次约定的利息情况' : value_range["约定情况"],
    '第2次约定的实际发生时间' : value_range["日期值"],
    '第2次约定的利率类型' : value_range["利率类型"],
    '第2次约定的利率数值（百分比或元）' : value_range["率数值"],
    '第3次约定的利息情况' : value_range["约定情况"],
    '第3次约定的实际发生时间' : value_range["日期值"],
    '第3次约定的利率类型' : value_range["利率类型"],
    '第3次约定的利率数值（百分比或元）' : value_range["率数值"],
    '初始约定的逾期利息情况' : value_range["约定情况"],
    '初始约定的实际发生时间' : value_range["日期值"],
    '初始约定的逾期利率类型' : value_range["利率类型"],
    '初始约定的逾期利率数值（百分比或元）' : value_range["率数值"],
    '第2次约定的逾期利息情况' : value_range["约定情况"],
    '第2次约定的实际发生时间' : value_range["日期值"],
    '第2次约定的逾期利率类型' : value_range["利率类型"],
    '第2次约定的逾期利率数值（百分比或元）' : value_range["率数值"],
    '第3次约定的逾期利息情况' : value_range["约定情况"],
    '第3次约定的实际发生时间' : value_range["日期值"],
    '第3次约定的逾期利率类型' : value_range["利率类型"],
    '第3次约定的逾期利率数值（百分比或元）' : value_range["率数值"],
    '初始约定的违约金情况' : value_range["约定情况"],
    '初始约定的实际发生时间' : value_range["日期值"],
    '初始约定的违约金类型' : value_range["利率类型"],
    '初始约定的违约金数值（百分比或元）' : value_range["率数值"],
    '第2次约定的违约金情况' : value_range["约定情况"],
    '第2次约定的实际发生时间' : value_range["日期值"],
    '第2次约定的违约金类型' : value_range["利率类型"],
    '第2次约定的违约金数值（百分比或元）' : value_range["率数值"],
    '第3次约定的违约金情况' : value_range["约定情况"],
    '第3次约定的实际发生时间' : value_range["日期值"],
    '第3次约定的违约金类型' : value_range["利率类型"],
    '第3次约定的违约金数值（百分比或元）' : value_range["率数值"],
    '管辖约定情况' : value_range["约定情况"],
    '仲裁约定情况' : value_range["约定情况"],
    '程序性费用的承担（律师费、诉讼费等）约定情况' : value_range["约定情况"],
    '约定程序性费用承担情况类型' : value_range["约定程序性费用承担情况类型"],
    '初始约定的还款方式情况' : value_range["约定情况"],
    '初始约定的实际发生时间' : value_range["日期值"],
    '初始约定的本金还款方式' : value_range["约定还款方式类型"],
    '初始约定的利息还款方式' : value_range["约定还款方式类型"],
    '前述还款方式下每次还款总金额（元）' : value_range["金额"],
    '前述还款方式下每次还款日期' : value_range["日期值"],
    '第2次约定的还款方式情况' : value_range["约定情况"],
    '第2次约定的实际发生时间' : value_range["日期值"],
    '第2次约定的本金还款方式' : value_range["约定还款方式类型"],
    '第2次约定的利息还款方式' : value_range["约定还款方式类型"],
    '前述还款方式下每次还款总金额（元）' : value_range["金额"],
    '前述还款方式下每次还款日期' : value_range["日期值"],
    '第3次约定的还款方式情况' : value_range["约定情况"],
    '第3次约定的实际发生时间' : value_range["日期值"],
    '第3次约定的本金还款方式' : value_range["约定还款方式类型"],
    '第3次约定的利息还款方式' : value_range["约定还款方式类型"],
    '前述还款方式下每次还款总金额（元）' : value_range["金额"],
    '前述还款方式下每次还款日期' : value_range["日期值"],
    '初始约定的担保情况' : value_range["约定情况"],
    '初始约定的实际发生时间' : value_range["日期值"],
    '初始约定的担保方式类型' : value_range["担保方式类型"],
    '初始约定的担保范围' : value_range["字符串"],
    '初始约定的担保期限（月）' : value_range["金额"],
    '担保物当下状态' : value_range["字符串"],
    '初始约定的担保人类型' : value_range["担保人类型"],
    '初始约定的保证责任类型' : value_range["担保责任类型"],
    '第2次约定的担保情况' : value_range["约定情况"],
    '第2次约定的实际发生时间' : value_range["日期值"],
    '第2次约定的担保方式类型' : value_range["担保方式类型"],
    '第2次约定的担保范围' : value_range["字符串"],
    '第2次约定的担保期限（月）' : value_range["金额"],
    '担保物当下状态' : value_range["字符串"],
    '第2次约定的担保人类型' : value_range["担保人类型"],
    '第2次约定的保证责任类型' : value_range["担保责任类型"],
    '第3次约定的担保情况' : value_range["约定情况"],
    '第3次约定的实际发生时间' : value_range["日期值"],
    '第3次约定的担保方式类型' : value_range["担保方式类型"],
    '第3次约定的担保范围' : value_range["字符串"],
    '第3次约定的担保期限（月）' : value_range["金额"],
    '担保物当下状态' : value_range["字符串"],
    '第3次约定的担保人类型' : value_range["担保人类型"],
    '第3次约定的保证责任类型' : value_range["担保责任类型"],
    '借款实际交付金额1（元）' : value_range["金额"],
    '借款实际交付时间1' : value_range["日期值"],
    '借款实际交付方式类型1' : value_range["交付方式类型"],
    '借款实际交付1所对应的是第几笔借款' : value_range["数值"],
    '借款实际交付金额2（元）' : value_range["金额"],
    '借款实际交付时间2' : value_range["日期值"],
    '借款实际交付方式类型2' : value_range["交付方式类型"],
    '借款实际交付2所对应的是第几笔借款' : value_range["数值"],
    '借款实际交付金额3（元）' : value_range["金额"],
    '借款实际交付时间3' : value_range["日期值"],
    '借款实际交付方式类型3' : value_range["交付方式类型"],
    '借款实际交付3所对应的是第几笔借款' : value_range["数值"],
    '已还款总体情况类型' : value_range["已还款总体情况类型"],
    '已还款时间1' : value_range["日期值"],
    '已还款金额1（元）' : value_range["金额"],
    '已还款方式1' : value_range["交付方式类型"],
    '已还款金额性质1' : value_range["金额性质"],
    '已还款金额1所对应的是第几笔借款' : value_range["数值"],
    '已还款金额1所冲抵利息至哪一日' : value_range["日期值"],
    '已还款时间2' : value_range["日期值"],
    '已还款金额2（元）' : value_range["金额"],
    '已还款方式2' : value_range["交付方式类型"],
    '已还款金额性质2' : value_range["金额性质"],
    '已还款金额2所对应的是第几笔借款' : value_range["数值"],
    '已还款金额2所冲抵利息至哪一日' : value_range["日期值"],
    '已还款时间3' : value_range["日期值"],
    '已还款金额3（元）' : value_range["金额"],
    '已还款方式3' : value_range["交付方式类型"],
    '已还款金额性质3' : value_range["金额性质"],
    '已还款金额3所对应的是第几笔借款' : value_range["数值"],
    '已还款金额3所冲抵利息至哪一日' : value_range["日期值"],
    # 特殊
    "法院对夫妻债务的认定": value_range["法院对夫妻债务的认定"],
    "法院对砍头息的认定" : value_range["法院对砍头息的认定"],
    "法院对公司为股东担保的效力的认定" : value_range["法院对公司为股东担保的效力的认定"],
    "债权取得类型" : value_range["债权取得类型"],
    "法院对主体资格与合同效力的认定" : value_range["法院对主体资格与合同效力的认定"],
    "法院对职业放贷人的认定" : value_range["法院对职业放贷人的认定"],
    "法院对是否属于互联网平台责任的认定" : value_range["是否"],
    "法院对民事案件的处理程序" : value_range["法院对民事案件的处理程序"],
})

Defendant_argue_attributes = deepcopy(Plaintiff_claim_attributes)

Court_determination_attributes = deepcopy(Plaintiff_claim_attributes)

kg_schema = {
    "intro" : "这是一个关于民间借贷案件裁判文书的知识图谱，图中有法院、原告（出借人）、被告（借款人或担保人）三类实体，实体的属性包括各方的基本信息和对案件事实的不同视角的称述。其中由原告提起诉讼并陈述，被告可以对任何一点进行抗辩，法庭则需要查明事实并最终裁决。",
    "entity_type" : "multi_entity",        # "single_entity", or "multi_entity"
    "event_type" : "static",        # 完全静态如E2E和Rotowire的属性"static", 属性类化可多次可迭代成整体的"dynamic"
    "entity":{
        "法院":{
            "number": (1,1),
            "intro" : "法院",
            "predicate" : "判定",
            "attributes" : Court_determination_attributes
        },
        "出借人（原告）":{
            "number": (1,5),
            "intro" : "Plaintiff",
            "predicate" : "诉称",
            "attributes": Plaintiff_claim_attributes
        },
        "借款人（被告）":{
            "number": (1,8),
            "intro" : "Defendant被告（借款人、担保人）",
            "predicate" : "辩称",
            "attributes" : Defendant_argue_attributes
        },
    },
    "relation":{                    # 仅仅记录需要被采集的关系
        "Plaintiff_and_Defendant":{
            "BorrowingAndOwing":{
                "number": (1,1),        # 单次单笔借款
                "intro" : "原告是出借人，被告是借款人、担保人以及其他相关人员"      # 有向
            },
        }
    }
}


